DATAFRAMES AND SERIES : THESE ARE DATATYPES IN PANDAS

DATAFRAMES: DataFrames are nothing but tabular form of data that has rows and columns

In [1]:
import pandas as pd
people={
    "First" :["Siddhant","Rupaniwta","Karan"],
    "Last" :["Roy","Sahani","Yadav"],
    "Email":["siddhantroy@gmail.com","rupaniwtasahani@gmail.com","karanyadaav@gmail.com"]
}
df=pd.DataFrame(people)
df

#pd.DataFrame took the people dictionary and made the data into a tabular form where each key becomes columns and each value becomes the value of the row

       First    Last                      Email
0   Siddhant     Roy      siddhantroy@gmail.com
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com
2      Karan   Yadav      karanyadaav@gmail.com

ACCESING SINGLE COLUMNS : We can access each columns like we use to access values in a dictionary , to get all the values of Email we simply write df["Email"]

In [3]:
df["Email"]

0        siddhantroy@gmail.com
1    rupaniwtasahani@gmail.com
2        karanyadaav@gmail.com
Name: Email, dtype: object

In [11]:
type(df["Email"])

pandas.core.series.Series

SERIES: NOW IN THE ABOVE CODE WHEN WE TRIED TO ACCESS A SINGLE COLUMN WE GET A SERIES, YOU CAN THINK OF A SERIES LIKE WHEN YOU ARE ONLY VIEWING A SINGLE COLUMN . IT IS NOT IN A TABULAR FORM LIKE A DATAFRAME .

"



"

ACCESSING MULTIPLE COLUMNS: PASS THE COLUMNS INSIDE A LIST SO THAT IT DOESN'T GIVE ERROR . NOW WHEN WE ACCESS MORE THAN ONE COLUMN IT'S GIVING ME A DATAFRAME

In [13]:
df[["First","Last"]]

       First    Last
0   Siddhant     Roy
1  Rupaniwta  Sahani
2      Karan   Yadav

In [14]:
#SEEING ALL THE COLUMN NAMES:

df.columns

Index(['First', 'Last', 'Email'], dtype='object')

ACCESSING ROWS :

1. iloc() : IMAGER LOCATION , USES INDEXS OR IMAGERS TO LOCATE THE SPECIFIC DATA

In [15]:
df.iloc[0]
#gives the data of the first row (index starts from 0) and the output is a series . When using iloc and accesing only one row , the column names are set as indexes so we can see the values of each column easily of that row.

First                 Siddhant
Last                       Roy
Email    siddhantroy@gmail.com
Name: 0, dtype: object

In [4]:
#Accessing multiple rows:
#When we access more than one row it gives the output as a dataframe

df.iloc[[0,1]]  

#[0,1] is the first and second rows and we have to pass those two rows inside a list

       First    Last                      Email
0   Siddhant     Roy      siddhantroy@gmail.com
1  Rupaniwta  Sahani  rupaniwtasahani@gmail.com

ACCESSING SPECIFIC ROWS AND COLUMNS TOGETHER USING ILOC:

In [17]:
df.iloc[[0,1],[1,2]]
#here iloc takes first list as to show which rows 0,1 means first and second row and the second list is to show which columns we wanna access so [1,2] means second and third columns

     Last                      Email
0     Roy      siddhantroy@gmail.com
1  Sahani  rupaniwtasahani@gmail.com

2. loc(): It locates the data from its labels for a row it's label is it's indexes like 0,1,2 but for a column it's names are it's labels.

In [25]:
df.loc[[0,1],["First","Last"]]

       First    Last
0   Siddhant     Roy
1  Rupaniwta  Sahani

In [26]:
df_2=pd.read_csv("Pokemon.csv")
df_2

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [32]:
#SHOW THE VALUES IN THE Name COLUMN:

df_2["Name"]

0                  Bulbasaur
1                    Ivysaur
2                   Venusaur
3      VenusaurMega Venusaur
4                 Charmander
               ...
795                  Diancie
796      DiancieMega Diancie
797      HoopaHoopa Confined
798       HoopaHoopa Unbound
799                Volcanion
Name: Name, Length: 800, dtype: object

In [33]:
#If we want to count the number of occurences of value in a column we can use value.count() method , we generally use it when there is columns with yes/no values or true/false values 

df_2["Legendary"].value_counts()

Legendary
False    735
True      65
Name: count, dtype: int64

In [39]:
#Show the first record or the first row:
df_2.loc[0]

#                     1
Name          Bulbasaur
Type 1            Grass
Type 2           Poison
Total               318
HP                   45
Attack               49
Defense              49
Sp. Atk              65
Sp. Def              65
Speed                45
Generation            1
Legendary         False
Name: 0, dtype: object

In [38]:
#Show the first record for the type 1 column only.
df_2.loc[0,"Type 1"]

'Grass'

In [44]:
#Show the first 5 records for the type 1 column:
df_2.loc[0:4,"Type 1"]

# to show multiple rows instead of writing [0,1,2,3,4] we can simply write 0:4 which is kind of similar like slicing a string but here 3 is inclusive

0    Grass
1    Grass
2    Grass
3    Grass
4     Fire
Name: Type 1, dtype: object

In [45]:
#Show the first 5 records for columns from Name to HP:

df_2.loc[0:4,"Name":"HP"]

                    Name Type 1  Type 2  Total  HP
0              Bulbasaur  Grass  Poison    318  45
1                Ivysaur  Grass  Poison    405  60
2               Venusaur  Grass  Poison    525  80
3  VenusaurMega Venusaur  Grass  Poison    625  80
4             Charmander   Fire     NaN    309  39